//——————————————————————————————————双击回到顶部——————————————————————————————————
$("body").dblclick(function () {
    window.getSelection().removeAllRanges();
    $("html, body").animate({scrollTop: 0}, 300);
});
//——————————————————————————————————双击回到顶部——————————————————————————————————

//——————————————————————————————————方向键切换上下页———————————————————————————————
$("body").keyup(function(e) {
  if ($("textarea").is(":focus") || $("input").is(":focus")) return;

  if (e.keyCode == 37) {
    // 按下左键，上一页
    $("#pnprev")[0].click();
  } else if (e.keyCode == 39) {
    // 按下右键，下一页
    $("#pnnext")[0].click();
  }
});
//——————————————————————————————————方向键切换上下页———————————————————————————————